language/nat_try.org
#+TITLE: Untitled Proto-Language 1
#+AUTHOR: Emmy Emmycelium
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style.css" />

* Phonology
** Consonants
The consonant inventory is as follows
#+BEGIN_EXPORT html
<table><tbody><tr class="head">
    <th></th>
    <th scope="col" colspan="2">Labial</th>
    <th scope="col" colspan="2">Alevolar</th>
    <th scope="col" colspan="2">Dorsal</th>
    <th scope="col">Uvular</th>
</tr><tr>
    <th scope="row">Nasal</th>
    <td colspan="2">m</td>
    <td colspan="2">n</td>
    <td colspan="2">ŋ</td>
    <td>(ɴ)</td>
</tr><tr>
    <th scope="row">Stop</th>
    <td>p</td>
    <td>b</td>
    <td>t</td>
    <td>d</td>
    <td>k</td>
    <td>g</td>
    <td>q</td>
</tr><tr>
    <th scope="row">Affricate</th>
    <td colspan="2"></td>
    <td>ts</td>
    <td rowspan="2">(d)z</td>
    <td colspan="2"></td>
    <td></td>
</tr><tr>
    <th scope="row">Fricative</th>
    <td colspan="2">f</td>
    <td>s</td>
    <td colspan="2">x</td>
    <td></td>
</tr><tr>
    <th scope="row">Approximant</th>
    <td colspan="2">(w)</td>
    <td colspan="2">l</td>
    <td colspan="2">(j)</td>
    <td></td>
</tr><tr>
    <th scope="row">Trill</th>
    <td colspan="2"></td>
    <td colspan="2">r</td>
    <td colspan="2"></td>
    <td></td>
</tr></tbody></table>
#+END_EXPORT

The realization of the phoneme /​dz/ varies between dialects, with some realizing it as a fricative and others as an affricate. /​f/ can be realized as either a bilabial fricative [ɸ] or a labiodental [f]. The velar consonants become palatalized before the close front vowel /​i/. The approximants [j] and [w] are allophones of the vowel phonemes /​i/ and /​u/ rather than consonant phonemes in their own right. The uvular nasal /​ɴ/ occurs only as an allophone of /​m/ before /​q/

For examples in this document, words are transcribed as they would be in ipa with the exceptions that /​ŋ/ is written as ng, /​m/ is written as n before non-labial stops, /​dz/ is written as z and /​ts/ is written as c.

** Vowels
The vowel inventory is as follows

#+BEGIN_EXPORT html
<table><tbody><tr class="head">
    <th></th>
    <th scope="col">Front</th>
    <th scope="col">Back</th>
</tr><tr>
    <th scope="row">Close</th>
    <td>i</td>
    <td>u</td>
</tr><tr>
    <th scope="row">Mid</th>
    <td>e</td>
    <td>o</td>
</tr><tr>
    <th scope="row">Open</th>
    <td colspan="2">a</td>
</tr></tbody></table>
#+END_EXPORT

As mentioned above, the close vowels /​i/ and /​u/ have glide allophones [j] and [w]. /​a/, /​e/ and /​o/ contrast with long /​aː/, /​eː/ and /​oː/ (transcribed ā, ē, ō). 

** Phonotactics
Syllables may contain an onset consonant, a medial glide, a nucleus, and a final consonant, though the only one of these positions which /must/ be filled is the nucleus.

*** Onsets
All consonants may act as the onset of a syllable, however an initial uvular stop /​q/ restricts what finals may occur. Namely, no medials may occur with this consonant and the nucleus may not be a high vowel (/​i/ or /​u/).

*** Finals
Finals maximally consist of a medial, a nucleus, and a coda consonant. For most syllables, the nucleus will be one of the 5 short vowels. The medial may then be either /​i/ or /​u/, with the restriction that front medials may not occur with front vowels and back medials may not occur with back vowels (e.g. */je/ is not an allowed final). The coda consonant may be /​p/, /​t/, /​k/, /​m/ or /​r/. Note that while the nasal coda is transcribed as /​m/ and this is its realization in isolation, within the context of a longer utterance it will harmonize to the place of articulation of the following consonant. Therefore a word such as rm-da "of animal fats" will become rnda

For syllables with a long vowel as the nucleus, there cannot be both a medial and a coda and only the stop codas can occur.

There are also syllables which have a syllabic consonant, either /​r/ or /​m/, as their nucleus instead of a vowel. These syllables never have a medial or a coda, and just as with coda /​m/, the syllabic /​m/ as nucleus will harmonize with the following consonant. 

*** Strong and Weak syllables
Syllables which contain a long vowel, have a medial and a short vowel, or have an  /​r/ or /​m/ coda are considered "strong", while other syllables are considered "weak". 

In some contexts, strong syllables may undergo weakening. When a syllable with a long vowel weakens, the vowel shortens. For those with a short vowel and a medial, the short vowel drops out and the medial glide becomes a vowel. Lastly, for those with an /​r/ or /​m/ coda, the vowel drops out and the coda becomes the nucleus.

Similarly, weak syllables may sometimes undergo strengthening. For syllables with a short /​a/, /​e/ or /​o/ as the nucleus, the vowel lengthens. For those with /​i/ or /​u/ as the nucleus, an /​a/ is inserted after, making the former nucleus into a medial. For those with syllabic /​r/ or /​m/, an /​a/ is inserted before, making the nucleus into a coda.

In inflection tables throughout the rest of this document, red cells indicate forms for which the final syllable should be weakened, and green cells indicate those for which it should be strengthened.

* Inflectional Morphology
