language/nat_try.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-23 Mon 19:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Untitled Proto-Language 1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Emmy Emmycelium" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Untitled Proto-Language 1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1113f72">1. Phonology</a>
<ul>
<li><a href="#org43e7a5c">1.1. Consonants</a></li>
<li><a href="#orgfacb1fc">1.2. Vowels</a></li>
<li><a href="#org76a7222">1.3. Phonotactics</a>
<ul>
<li><a href="#orgac00e0b">1.3.1. Onsets</a></li>
<li><a href="#org5252efc">1.3.2. Finals</a></li>
<li><a href="#org5ee6b13">1.3.3. Strong and Weak syllables</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf70c1ba">2. Inflectional Morphology</a>
<ul>
<li><a href="#orgf56cd54">2.1. Nouns</a></li>
<li><a href="#org9d51e3f">2.2. Pronouns</a></li>
<li><a href="#org04473fe">2.3. <span class="todo TODO">TODO</span> Verbs</a>
<ul>
<li><a href="#org36779ff">2.3.1. Perfective</a></li>
<li><a href="#org114ad2f">2.3.2. Past Imperfective</a></li>
<li><a href="#org6401118">2.3.3. Non-Past Imperfective</a></li>
<li><a href="#org20cf5e0">2.3.4. Imperative</a></li>
<li><a href="#org1d33354">2.3.5. Oddities</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1526fc5">3. <span class="todo TODO">TODO</span> Derivational Morphology</a></li>
<li><a href="#org5d4d068">4. <span class="todo TODO">TODO</span> Syntax</a>
<ul>
<li><a href="#orgd7acf36">4.1. Prepositions</a></li>
<li><a href="#org74d6793">4.2. Sentence Structure</a>
<ul>
<li><a href="#org3a6a5f3">4.2.1. Nominal and Prepositional Predicate Sentences</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4c31513">5. Lexicon</a>
<ul>
<li><a href="#orgf4e6929">5.1. Nouns</a>
<ul>
<li><a href="#orgc0f9ba4">5.1.1. Natural World</a></li>
<li><a href="#org2d33be9">5.1.2. Plants and Fungi</a></li>
<li><a href="#orgd279bde">5.1.3. Animals</a></li>
<li><a href="#org22550ea">5.1.4. People</a></li>
<li><a href="#org5402188">5.1.5. Body Parts</a></li>
<li><a href="#orgcf754c5">5.1.6. Material Culture</a></li>
</ul>
</li>
<li><a href="#org697477b">5.2. Verbs</a>
<ul>
<li><a href="#org11014da">5.2.1. Sound Emissions</a></li>
<li><a href="#orgea00d17">5.2.2. Mental States</a></li>
<li><a href="#orgc64c5fc">5.2.3. Spatial states</a></li>
</ul>
</li>
<li><a href="#orgf2e380b">5.3. Prepositions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1113f72" class="outline-2">
<h2 id="org1113f72"><span class="section-number-2">1</span> Phonology</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org43e7a5c" class="outline-3">
<h3 id="org43e7a5c"><span class="section-number-3">1.1</span> Consonants</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The consonant inventory is as follows
</p>
<table><tbody><tr class="head">
    <th></th>
    <th scope="col" colspan="2">Labial</th>
    <th scope="col" colspan="2">Alevolar</th>
    <th scope="col" colspan="2">Dorsal</th>
    <th scope="col">Uvular</th>
</tr><tr>
    <th scope="row">Nasal</th>
    <td colspan="2">m</td>
    <td colspan="2">n</td>
    <td colspan="2">ŋ</td>
    <td>(ɴ)</td>
</tr><tr>
    <th scope="row">Stop</th>
    <td>p</td>
    <td>b</td>
    <td>t</td>
    <td>d</td>
    <td>k</td>
    <td>g</td>
    <td>q</td>
</tr><tr>
    <th scope="row">Affricate</th>
    <td colspan="2"></td>
    <td>ts</td>
    <td rowspan="2">(d)z</td>
    <td colspan="2"></td>
    <td></td>
</tr><tr>
    <th scope="row">Fricative</th>
    <td colspan="2">f</td>
    <td>s</td>
    <td colspan="2">x</td>
    <td></td>
</tr><tr>
    <th scope="row">Approximant</th>
    <td colspan="2">(w)</td>
    <td colspan="2">l</td>
    <td colspan="2">(j)</td>
    <td></td>
</tr><tr>
    <th scope="row">Trill</th>
    <td colspan="2"></td>
    <td colspan="2">r</td>
    <td colspan="2"></td>
    <td></td>
</tr></tbody></table>

<p>
The realization of the phoneme /​dz/ varies between dialects, with some realizing it as a fricative and others as an affricate. /​f/ can be realized as either a bilabial fricative [ɸ] or a labiodental [f]. The velar consonants become palatalized before the close front vowel /​i/. The approximants [j] and [w] are allophones of the vowel phonemes /​i/ and /​u/ rather than consonant phonemes in their own right. The uvular nasal /​ɴ/ occurs only as an allophone of /​m/ before /​q/
</p>

<p>
For examples in this document, words are transcribed as they would be in ipa with the exceptions that /​ŋ/ is written as ng, /​m/ is written as n before non-labial stops, /​dz/ is written as z and /​ts/ is written as c.
</p>
</div>
</div>

<div id="outline-container-orgfacb1fc" class="outline-3">
<h3 id="orgfacb1fc"><span class="section-number-3">1.2</span> Vowels</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The vowel inventory is as follows
</p>

<table><tbody><tr class="head">
    <th></th>
    <th scope="col">Front</th>
    <th scope="col">Back</th>
</tr><tr>
    <th scope="row">Close</th>
    <td>i</td>
    <td>u</td>
</tr><tr>
    <th scope="row">Mid</th>
    <td>e</td>
    <td>o</td>
</tr><tr>
    <th scope="row">Open</th>
    <td colspan="2">a</td>
</tr></tbody></table>

<p>
As mentioned above, the close vowels /​i/ and /​u/ have glide allophones [j] and [w]. /​a/, /​e/ and /​o/ contrast with long /​aː/, /​eː/ and /​oː/ (transcribed ā, ē, ō). 
</p>
</div>
</div>

<div id="outline-container-org76a7222" class="outline-3">
<h3 id="org76a7222"><span class="section-number-3">1.3</span> Phonotactics</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Syllables may contain an onset consonant, a medial glide, a nucleus, and a final consonant, though the only one of these positions which <i>must</i> be filled is the nucleus.
</p>
</div>

<div id="outline-container-orgac00e0b" class="outline-4">
<h4 id="orgac00e0b"><span class="section-number-4">1.3.1</span> Onsets</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
All consonants may act as the onset of a syllable, however an initial uvular stop /​q/ restricts what finals may occur. Namely, no medials may occur with this consonant and the nucleus may not be a high vowel (/​i/ or /​u/).
</p>
</div>
</div>

<div id="outline-container-org5252efc" class="outline-4">
<h4 id="org5252efc"><span class="section-number-4">1.3.2</span> Finals</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Finals maximally consist of a medial, a nucleus, and a coda consonant. For most syllables, the nucleus will be one of the 5 short vowels. The medial may then be either /​i/ or /​u/, with the restriction that front medials may not occur with front vowels and back medials may not occur with back vowels (e.g. */je/ is not an allowed final). The coda consonant may be /​p/, /​t/, /​k/, /​m/ or /​r/. Note that while the nasal coda is transcribed as /​m/ and this is its realization in isolation, within the context of a longer utterance it will harmonize to the place of articulation of the following consonant. Therefore a word such as rm-da "of animal fats" will become rnda
</p>

<p>
For syllables with a long vowel as the nucleus, there cannot be both a medial and a coda and only the stop codas can occur.
</p>

<p>
There are also syllables which have a syllabic consonant, either /​r/ or /​m/, as their nucleus instead of a vowel. These syllables never have a medial or a coda, and just as with coda /​m/, the syllabic /​m/ as nucleus will harmonize with the following consonant. 
</p>
</div>
</div>

<div id="outline-container-org5ee6b13" class="outline-4">
<h4 id="org5ee6b13"><span class="section-number-4">1.3.3</span> Strong and Weak syllables</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Syllables which contain a long vowel, have a medial and a short vowel, or have an  /​r/ or /​m/ coda are considered "strong", while other syllables are considered "weak". 
</p>

<p>
In some contexts, strong syllables may undergo weakening. When a syllable with a long vowel weakens, the vowel shortens. For those with a short vowel and a medial, the short vowel drops out and the medial glide becomes a vowel. Lastly, for those with an /​r/ or /​m/ coda, the vowel drops out and the coda becomes the nucleus.
</p>

<p>
Similarly, weak syllables may sometimes undergo strengthening. For syllables with a short /​a/, /​e/ or /​o/ as the nucleus, the vowel lengthens. For those with /​i/ or /​u/ as the nucleus, an /​a/ is inserted after, making the former nucleus into a medial. For those with syllabic /​r/ or /​m/, an /​a/ is inserted before, making the nucleus into a coda.
</p>

<p>
In inflection tables throughout the rest of this document, red cells indicate forms for which the final syllable should be weakened, and green cells indicate those for which it should be strengthened.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf70c1ba" class="outline-2">
<h2 id="orgf70c1ba"><span class="section-number-2">2</span> Inflectional Morphology</h2>
<div class="outline-text-2" id="text-2">
</div>
