language/nat_try.html
<div id="outline-container-orgf56cd54" class="outline-3">
<h3 id="orgf56cd54"><span class="section-number-3">2.1</span> Nouns</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Most nouns inflect for 2 numbers (singular and plural) and 3 cases (nominative, accusative, genitive). These inflections are distinguished through suffixes. The inflection paradigm is summarized in the table below
</p>

<table class="para"><tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td class="strong">&empty;</td>
    <td class="strong">-a</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>&empty;</td>
    <td>-sa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td class="weak">-(i)m</td>
    <td class="weak">-(i)da</td>
</tr></tbody></table>

<p>
The (i) in the genitive suffix indicates the fact that for consonant final roots (except those ending in <i>m</i>), the suffix is -im while for vowel final roots it is simply -m. An example noun declension is given below
</p>

<table class="para">
<caption><i>asi</i> "ruler"</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>asja</td>
    <td>asjā</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>asi</td>
    <td>asisa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>asim</td>
    <td>asida</td>
</tr></tbody></table>

<p>
However, not all nouns decline in such a straightforward way. The following sets of example paradigms illustrate a few nuances of this declension system.
</p>

<div class="holder">
<table class="para">
<caption><i>xwar</i> "iron"</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>xwar</td>
    <td>xwara</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>xwar</td>
    <td>xwarsa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>xurim</td>
    <td>xurida</td>
</tr></tbody></table>

<table class="para">
<caption><i>rm</i> "animal fat"</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>ram</td>
    <td>rama</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>rm</td>
    <td>rnsa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>rm</td>
    <td>rnda</td>
</tr></tbody></table>
</div>

<p>
As these examples demonstrate, the different cases have a tendency to collapse in the singular. For strong nouns, the nominative and accusative collapse, while for weak nouns with a final -m, the genitive and accusative collapse.
</p>

<div class="holder">
<table class="para">
<caption><i>rsā</i> "Person"</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>rsā</td>
    <td>rsā</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>rsā</td>
    <td>rsāsa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>rsam</td>
    <td>rsada</td>
</tr></tbody></table>

<table class="para">
<caption><i>cē</i> "mosquito"</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>cē</td>
    <td>ceja</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>cē</td>
    <td>cēsa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>cem</td>
    <td>ceda</td>
</tr></tbody></table>

<table class="para">
<caption><i>mō</i> "hill"</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</thi could fix her>
    <td>mō</td>
    <td>mowa</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>mō</td>
    <td>mōsa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>mom</td>
    <td>moda</td>
</tr></tbody></table>
</div>

<p>
These three examples show the oddities that can occur with roots ending in a "true" vowel (i.e. not <i>i</i> or <i>u</i>). For those ending with <i>a</i> or <i>ā</i>, the nominative plural will be the same as the nominative and accusative singular. For those ending with <i>e</i>, <i>ē</i>, <i>o</i> or <i>ō</i>, the singular and plural don't merge, but a glide is inserted to break up the two vowels, and the primary vowel shortens to compensate.
</p>

<table class="para">
<caption><i>qa</i> "spear"</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>qā</td>
    <td>qā</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>qa</td>
    <td>qasa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>qaim</td>
    <td>qada</td>
</tr></tbody></table>

<p>
This example demonstrates some oddities in the genitives of nouns whose final syllable is open and begins with <i>q</i>. Since such syllables cannot have a nasal coda, the ending -<i>im</i> is used. In actual pronunciation, this sequence is realized with a glide breaking up the two vowels, i.e. <i>qaim</i> is pronounced [qa.jim].
</p>

<p>
Lastly, some nouns (almost entirely body parts) have distinct dual forms. These forms are identical to the plurals but with final <i>o</i> instead of <i>a</i>, and final <i>ō</i> instead of <i>ā</i>.
</p>
</div>
</div>
