language/nat_try.org
** Pronouns

Each pronoun has 3 cases (the same as for nouns) and 3 numbers (singular, dual, and plural) for a total of 9 forms. There are 4 separate pronouns for the 1st person, 2nd person, animate 3rd person and inanimate 3rd person. The dual forms of the inanimate 3rd person, while given here by analogy with the animate 3rd person, are unattested in actual use.

#+BEGIN_EXPORT html
<div class="holder">
<table class="para">
<caption><i>ja</i> 1st person</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>ja</td>
    <td>jō</td>
    <td>jā</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>ja</td>
    <td>jaso</td>
    <td>jasa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>im</td>
    <td>ido</td>
    <td>ida</td>
</tr></tbody></table>
<table class="para">
<caption><i>bjak</i> 2nd person</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>bjak</td>
    <td>bjako</td>
    <td>bjaka</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>bjak</td>
    <td>bjakso</td>
    <td>bjaksa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>bim</td>
    <td>bido</td>
    <td>bida</td>
</tr></tbody></table>
<table class="para">
<caption><i>nge</i> 3nd person animate</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>ngē</td>
    <td>ngejo</td>
    <td>ngeja</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>nge</td>
    <td>ngeso</td>
    <td>ngesa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>ngem</td>
    <td>ngedo</td>
    <td>ngeda</td>
</tr></tbody></table>
<table class="para">
<caption><i>le</i> 3nd person inanimate</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>lē</td>
    <td>*lejo</td>
    <td>leja</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>le</td>
    <td>*leso</td>
    <td>lesa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>lem</td>
    <td>*ledo</td>
    <td>leda</td>
</tr></tbody></table>
</div>
#+END_EXPORT

In addition to these independent forms, there are also clitic forms of the nominative pronouns, whose use is explained in the following section.

#+BEGIN_EXPORT html
<table class="para"><tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">1</th>
    <td>ja-</td>
    <td>jo-</td>
    <td>ja-</td>
</tr><tr>
    <th scope="row">2</th>
    <td>bak-</td>
    <td>bako-</td>
    <td>baka-</td>
</tr><tr>
    <th scope="row">3anim</th>
    <td>nge-</td>
    <td>ngo-</td>
    <td>nga-</td>
</tr><tr>
    <th scope="row">3inan</th>
    <td>le-</td>
    <td>*lo-</td>
    <td>la-</td>
</tr></tbody></table>
#+END_EXPORT

** TODO Verbs

Verbs have 4 finite forms. These are the perfective, past imperfective, non-past imperfective, and imperative. Verbs are split into those with inherent perfective aspect and those with inherent imperfective aspect. Imperfective verbs encompass stative verbs and atelic active verbs, while telic active verbs are perfective. For most verbs telicity is a constant property of the word, but for some verbs (mostly verbs of motion) their telicity and thus their inherent aspect depends on whether they are used intransitively (as in "he walks") or transitively (as in "he walks to the city"), with the former being atelic and thus imperfective and the latter being telic and thus perfective. 

The inflection patterns and the semantics of some of the inflections for these two categories are different as will be seen below.

#+BEGIN_EXPORT html
<div class="holder">
<table class="para">
<caption>Perfective</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>&empty;</td>
</tr><tr>
    <th scope="row">npst ipfv</th>
    <td>-ja</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>na-...-ja</td>
</tr><tr>
    <th scope="row">imp</th>
    <td class="strong">-ra</td>
</tr></tbody></table>
<table class="para">
<caption>Imperfective</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>-i</td>
</tr><tr>
    <th scope="row">pres ipfv</th>
    <td>&empty;</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>na-</td>
</tr><tr>
    <th scope="row">imp</th>
    <td class="strong">-ira</td>
</tr></tbody></table>
</div>
#+END_EXPORT

example paradigms are provided below for a perfective verb and an imperfective verb

#+BEGIN_EXPORT html
<div class="holder">
<table class="para">
<caption><i>su</i> "say"</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>su</td>
</tr><tr>
    <th scope="row">npst ipfv</th>
    <td>suja</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>nasuja</td>
</tr><tr>
    <th scope="row">imp</th>
    <td>swara</td>
</tr></tbody></table>
<table class="para">
<caption><i>xak</i> "know"</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>xaki</td>
</tr><tr>
    <th scope="row">npst ipfv</th>
    <td>xak</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>naxak</td>
</tr><tr>
    <th scope="row">imp</th>
    <td>xakira</td>
</tr></tbody></table>
</div>
#+END_EXPORT

*** Perfective

 The perfective is used for an event viewed as a simple whole without internal structure. On its own it most commonly has past tense meaning, though it may also be used for narrating events as they happen in the present or for simple future events which have a definite time expressed by an adverbial phrase. Future events without an adverbial phrase expressing a time dont use any of the finite verb forms, and will be discussed later.

 For verbs with inherent imperfective aspect, the perfective generally indicates the beginning of the atelic action or the state which the verb describes, thus /ngaxaki/ would mean (keeping in mind the caveats about tense given above) "they began to know" or more idiomatically "they learned". A special case of this is for verbs which express spatial configuration such as /krgr/ "to be scattered", for which the perfect expresses movement into that state, as in /ngakrgir/ "they scattered." The perfective form of an imperfective verb can also have the imperfective suffix -/ja/ added on top of the eprfective suffix -/i/ to convey the start of the state or action as an ongoing event of its own, as in /ngakrgirja/ "they are scattering" 

*** Past Imperfective

 The past imperfective is used for actions viewed as ongoing which ended in the past.

*** Non-Past Imperfective

 The non-past imperfective is most commonly used to express ongoing actions which began in the past and continue through the present. Like the perfective, it may also have future meaning if used with an adverbial expressing a specific time. The default meaning of the future use of the non-past imperfective is that the start of the action is in the future but before the time which is specified, however it is also possible to express that an action which started in the past will still be ongoing in the future by adding the particle /la/ after the verb.

