language/nat_try.html
<div id="outline-container-org9d51e3f" class="outline-3">
<h3 id="org9d51e3f"><span class="section-number-3">2.2</span> Pronouns</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Each pronoun has 3 cases (the same as for nouns) and 3 numbers (singular, dual, and plural) for a total of 9 forms. There are 4 separate pronouns for the 1st person, 2nd person, animate 3rd person and inanimate 3rd person. The dual forms of the inanimate 3rd person, while given here by analogy with the animate 3rd person, are unattested in actual use.
</p>

<div class="holder">
<table class="para">
<caption><i>ja</i> 1st person</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>ja</td>
    <td>jō</td>
    <td>jā</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>ja</td>
    <td>jaso</td>
    <td>jasa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>im</td>
    <td>ido</td>
    <td>ida</td>
</tr></tbody></table>
<table class="para">
<caption><i>bjak</i> 2nd person</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>bjak</td>
    <td>bjako</td>
    <td>bjaka</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>bjak</td>
    <td>bjakso</td>
    <td>bjaksa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>bim</td>
    <td>bido</td>
    <td>bida</td>
</tr></tbody></table>
<table class="para">
<caption><i>nge</i> 3nd person animate</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>ngē</td>
    <td>ngejo</td>
    <td>ngeja</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>nge</td>
    <td>ngeso</td>
    <td>ngesa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>ngem</td>
    <td>ngedo</td>
    <td>ngeda</td>
</tr></tbody></table>
<table class="para">
<caption><i>le</i> 3nd person inanimate</caption>
<tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">nom</th>
    <td>lē</td>
    <td>*lejo</td>
    <td>leja</td>
</tr><tr>
    <th scope="row">acc</th>
    <td>le</td>
    <td>*leso</td>
    <td>lesa</td>
</tr><tr>
    <th scope="row">gen</th>
    <td>lem</td>
    <td>*ledo</td>
    <td>leda</td>
</tr></tbody></table>
</div>

<p>
In addition to these independent forms, there are also clitic forms of the nominative pronouns, whose use is explained in the following section.
</p>

<table class="para"><tbody><tr class="head">
    <th></th>
    <th scope="col">sg</th>
    <th scope="col">du</th>
    <th scope="col">pl</th>
</tr><tr>
    <th scope="row">1</th>
    <td>ja-</td>
    <td>jo-</td>
    <td>ja-</td>
</tr><tr>
    <th scope="row">2</th>
    <td>bak-</td>
    <td>bako-</td>
    <td>baka-</td>
</tr><tr>
    <th scope="row">3anim</th>
    <td>nge-</td>
    <td>ngo-</td>
    <td>nga-</td>
</tr><tr>
    <th scope="row">3inan</th>
    <td>le-</td>
    <td>*lo-</td>
    <td>la-</td>
</tr></tbody></table>
</div>
</div>

<div id="outline-container-org04473fe" class="outline-3">
<h3 id="org04473fe"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Verbs</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Verbs have 4 finite forms. These are the perfective, past imperfective, non-past imperfective, and imperative. Verbs are split into those with inherent perfective aspect and those with inherent imperfective aspect. Imperfective verbs encompass stative verbs and atelic active verbs, while telic active verbs are perfective. For most verbs telicity is a constant property of the word, but for some verbs (mostly verbs of motion) their telicity and thus their inherent aspect depends on whether they are used intransitively (as in "he walks") or transitively (as in "he walks to the city"), with the former being atelic and thus imperfective and the latter being telic and thus perfective. 
</p>

<p>
The inflection patterns and the semantics of some of the inflections for these two categories are different as will be seen below.
</p>

<div class="holder">
<table class="para">
<caption>Perfective</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>&empty;</td>
</tr><tr>
    <th scope="row">npst ipfv</th>
    <td>-ja</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>na-...-ja</td>
</tr><tr>
    <th scope="row">imp</th>
    <td class="strong">-ra</td>
</tr></tbody></table>
<table class="para">
<caption>Imperfective</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>-i</td>
</tr><tr>
    <th scope="row">pres ipfv</th>
    <td>&empty;</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>na-</td>
</tr><tr>
    <th scope="row">imp</th>
    <td class="strong">-ira</td>
</tr></tbody></table>
</div>

<p>
example paradigms are provided below for a perfective verb and an imperfective verb
</p>

<div class="holder">
<table class="para">
<caption><i>su</i> "say"</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>su</td>
</tr><tr>
    <th scope="row">npst ipfv</th>
    <td>suja</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>nasuja</td>
</tr><tr>
    <th scope="row">imp</th>
    <td>swara</td>
</tr></tbody></table>
<table class="para">
<caption><i>xak</i> "know"</caption>
<tbody><tr>
    <th scope="row">pfv</th>
    <td>xaki</td>
</tr><tr>
    <th scope="row">npst ipfv</th>
    <td>xak</td>
</tr><tr>
    <th scope="row">pst ipfv</th>
    <td>naxak</td>
</tr><tr>
    <th scope="row">imp</th>
    <td>xakira</td>
</tr></tbody></table>
</div>
</div>

<div id="outline-container-org36779ff" class="outline-4">
<h4 id="org36779ff"><span class="section-number-4">2.3.1</span> Perfective</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
The perfective is used for an event viewed as a simple whole without internal structure. On its own it most commonly has past tense meaning, though it may also be used for narrating events as they happen in the present or for simple future events which have a definite time expressed by an adverbial phrase. Future events without an adverbial phrase expressing a time dont use any of the finite verb forms, and will be discussed later.
</p>

<p>
For verbs with inherent imperfective aspect, the perfective generally indicates the beginning of the atelic action or the state which the verb describes, thus <i>ngaxaki</i> would mean (keeping in mind the caveats about tense given above) "they began to know" or more idiomatically "they learned". A special case of this is for verbs which express spatial configuration such as <i>krgr</i> "to be scattered", for which the perfect expresses movement into that state, as in <i>ngakrgir</i> "they scattered." The perfective form of an imperfective verb can also have the imperfective suffix -<i>ja</i> added on top of the eprfective suffix -<i>i</i> to convey the start of the state or action as an ongoing event of its own, as in <i>ngakrgirja</i> "they are scattering" 
</p>
</div>
</div>

<div id="outline-container-org114ad2f" class="outline-4">
<h4 id="org114ad2f"><span class="section-number-4">2.3.2</span> Past Imperfective</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
The past imperfective is used for actions viewed as ongoing which ended in the past.
</p>
</div>
</div>

<div id="outline-container-org6401118" class="outline-4">
<h4 id="org6401118"><span class="section-number-4">2.3.3</span> Non-Past Imperfective</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
The non-past imperfective is most commonly used to express ongoing actions which began in the past and continue through the present. Like the perfective, it may also have future meaning if used with an adverbial expressing a specific time. The default meaning of the future use of the non-past imperfective is that the start of the action is in the future but before the time which is specified, however it is also possible to express that an action which started in the past will still be ongoing in the future by adding the particle <i>la</i> after the verb.
</p>
</div>
</div>
