language/nat_try.org
*** Imperative

 The imperative can be used without an explicit subject to give commands, with the same form being used regardless of the number of people being addressed, as in /oxadō/ "kneel". The imperative form may also be used with an explicit subject to express optative meaning as in /ngawoxadō ngada sam bim/ "may they kneel before you."

*** Oddities

 Some intransitive verbs expressing spatial configuration such as /oxado/ "to be kneeling" are derived from prepositional phrases involving body parts, and so are followed by a genitive pronoun that matches the subject, as in /ngejoxado ngem/ "he is kneeling," historically from /ngejo kado ngem/ "he is on his two knees." Any verb endings will attach to the verb rather than to the genitive pronoun, so "she knelt" would be translated as /ngejoxadowi ngem/ and not /*ngejoxado ngemi/ 

* TODO Derivational Morphology

* TODO Syntax

** Prepositions

All adpositions are prepositions. Most prepositions expressing motion take their objects in the accusative, while those expressing static location take their object in the genitive. An exception to this is prepositions of motion which are historically derived from compounds of another preposition with a term for a body part, which take genitive objects.

** Sentence Structure

The basic structure of all sentences is [topic][comment]
   
*** Nominal and Prepositional Predicate Sentences

Sentences with a nominal predicate (i.e. of the form "A is B") and a pronominal subject are formed by attaching the clitic form of the pronoun to the nominative case of the predicate, as in /jāsja/ "I am a/the ruler." For those with a nominal subject, the subject is placed at the beginning followed by the 3rd person pronominal form of the sentence, as in /xansā ngejasja/ "Xansa is a/the ruler." This is in contrast to simply juxtaposing two nominative case nouns which is how apposition is expressed, as in /xansā asja/ "Xansa the ruler."

Sentences with a prepositional phrase as the predicate are formed in the same way, with a prepositional phrase appearing in the position of the nominal predicate.



* Lexicon
** Nouns
*** Natural World
  - /mr/ :: soil
  - /mō/ :: hill
  - /u/ :: water
*** Plants and Fungi
*** Animals
  - /cē/ :: mosquito
  - /fā/ :: pig
*** People
  - /rsā/ :: person
  - /asi/ :: ruler
*** Body Parts
  - /ka/ :: knee
*** Material Culture
  - /xwar/ :: iron
  - /qa/ :: spear
  - /rm/ :: animal fat (e.g. lard)
** Verbs
*** Sound Emissions
 - /su/ :: say
*** Mental States
 - /xak/ :: know
*** Spatial states
 - /krgr/ :: to be strewn about or scattered
** Prepositions
 - /o/ :: on
 - /sam/ :: in the presence of, before
 


 
