language/nat_try.html

<div id="outline-container-org20cf5e0" class="outline-4">
<h4 id="org20cf5e0"><span class="section-number-4">2.3.4</span> Imperative</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
The imperative can be used without an explicit subject to give commands, with the same form being used regardless of the number of people being addressed, as in <i>oxadō</i> "kneel". The imperative form may also be used with an explicit subject to express optative meaning as in <i>ngawoxadō ngada sam bim</i> "may they kneel before you."
</p>
</div>
</div>

<div id="outline-container-org1d33354" class="outline-4">
<h4 id="org1d33354"><span class="section-number-4">2.3.5</span> Oddities</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
Some intransitive verbs expressing spatial configuration such as <i>oxado</i> "to be kneeling" are derived from prepositional phrases involving body parts, and so are followed by a genitive pronoun that matches the subject, as in <i>ngejoxado ngem</i> "he is kneeling," historically from <i>ngejo kado ngem</i> "he is on his two knees." Any verb endings will attach to the verb rather than to the genitive pronoun, so "she knelt" would be translated as <i>ngejoxadowi ngem</i> and not <i>*ngejoxado ngemi</i> 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1526fc5" class="outline-2">
<h2 id="org1526fc5"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Derivational Morphology</h2>
</div>

<div id="outline-container-org5d4d068" class="outline-2">
<h2 id="org5d4d068"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Syntax</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd7acf36" class="outline-3">
<h3 id="orgd7acf36"><span class="section-number-3">4.1</span> Prepositions</h3>
<div class="outline-text-3" id="text-4-1">
<p>
All adpositions are prepositions. Most prepositions expressing motion take their objects in the accusative, while those expressing static location take their object in the genitive. An exception to this is prepositions of motion which are historically derived from compounds of another preposition with a term for a body part, which take genitive objects.
</p>
</div>
</div>

<div id="outline-container-org74d6793" class="outline-3">
<h3 id="org74d6793"><span class="section-number-3">4.2</span> Sentence Structure</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The basic structure of all sentences is [topic][comment]
</p>
</div>

<div id="outline-container-org3a6a5f3" class="outline-4">
<h4 id="org3a6a5f3"><span class="section-number-4">4.2.1</span> Nominal and Prepositional Predicate Sentences</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Sentences with a nominal predicate (i.e. of the form "A is B") and a pronominal subject are formed by attaching the clitic form of the pronoun to the nominative case of the predicate, as in <i>jāsja</i> "I am a/the ruler." For those with a nominal subject, the subject is placed at the beginning followed by the 3rd person pronominal form of the sentence, as in <i>xansā ngejasja</i> "Xansa is a/the ruler." This is in contrast to simply juxtaposing two nominative case nouns which is how apposition is expressed, as in <i>xansā asja</i> "Xansa the ruler."
</p>

<p>
Sentences with a prepositional phrase as the predicate are formed in the same way, with a prepositional phrase appearing in the position of the nominal predicate.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-org4c31513" class="outline-2">
<h2 id="org4c31513"><span class="section-number-2">5</span> Lexicon</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf4e6929" class="outline-3">
<h3 id="orgf4e6929"><span class="section-number-3">5.1</span> Nouns</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgc0f9ba4" class="outline-4">
<h4 id="orgc0f9ba4"><span class="section-number-4">5.1.1</span> Natural World</h4>
<div class="outline-text-4" id="text-5-1-1">
<dl class="org-dl">
<dt><i>mr</i></dt><dd>soil</dd>
<dt><i>mō</i></dt><dd>hill</dd>
<dt><i>u</i></dt><dd>water</dd>
</dl>
</div>
</div>
<div id="outline-container-org2d33be9" class="outline-4">
<h4 id="org2d33be9"><span class="section-number-4">5.1.2</span> Plants and Fungi</h4>
</div>
<div id="outline-container-orgd279bde" class="outline-4">
<h4 id="orgd279bde"><span class="section-number-4">5.1.3</span> Animals</h4>
<div class="outline-text-4" id="text-5-1-3">
<dl class="org-dl">
<dt><i>cē</i></dt><dd>mosquito</dd>
<dt><i>fā</i></dt><dd>pig</dd>
</dl>
</div>
</div>
<div id="outline-container-org22550ea" class="outline-4">
<h4 id="org22550ea"><span class="section-number-4">5.1.4</span> People</h4>
<div class="outline-text-4" id="text-5-1-4">
<dl class="org-dl">
<dt><i>rsā</i></dt><dd>person</dd>
<dt><i>asi</i></dt><dd>ruler</dd>
</dl>
</div>
</div>
<div id="outline-container-org5402188" class="outline-4">
<h4 id="org5402188"><span class="section-number-4">5.1.5</span> Body Parts</h4>
<div class="outline-text-4" id="text-5-1-5">
<dl class="org-dl">
<dt><i>ka</i></dt><dd>knee</dd>
</dl>
</div>
</div>
<div id="outline-container-orgcf754c5" class="outline-4">
<h4 id="orgcf754c5"><span class="section-number-4">5.1.6</span> Material Culture</h4>
<div class="outline-text-4" id="text-5-1-6">
<dl class="org-dl">
<dt><i>xwar</i></dt><dd>iron</dd>
<dt><i>qa</i></dt><dd>spear</dd>
<dt><i>rm</i></dt><dd>animal fat (e.g. lard)</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-org697477b" class="outline-3">
<h3 id="org697477b"><span class="section-number-3">5.2</span> Verbs</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org11014da" class="outline-4">
<h4 id="org11014da"><span class="section-number-4">5.2.1</span> Sound Emissions</h4>
<div class="outline-text-4" id="text-5-2-1">
<dl class="org-dl">
<dt><i>su</i></dt><dd>say</dd>
</dl>
</div>
</div>
<div id="outline-container-orgea00d17" class="outline-4">
<h4 id="orgea00d17"><span class="section-number-4">5.2.2</span> Mental States</h4>
<div class="outline-text-4" id="text-5-2-2">
<dl class="org-dl">
<dt><i>xak</i></dt><dd>know</dd>
</dl>
</div>
</div>
<div id="outline-container-orgc64c5fc" class="outline-4">
<h4 id="orgc64c5fc"><span class="section-number-4">5.2.3</span> Spatial states</h4>
<div class="outline-text-4" id="text-5-2-3">
<dl class="org-dl">
<dt><i>krgr</i></dt><dd>to be strewn about or scattered</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgf2e380b" class="outline-3">
<h3 id="orgf2e380b"><span class="section-number-3">5.3</span> Prepositions</h3>
<div class="outline-text-3" id="text-5-3">
<dl class="org-dl">
<dt><i>o</i></dt><dd>on</dd>
<dt><i>sam</i></dt><dd>in the presence of, before</dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Emmy Emmycelium</p>
<p class="date">Created: 2021-08-23 Mon 19:29</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>